Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : freertos.c
  * Description        : Code for freertos applications
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOS.h"
#include "task.h"
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "semphr.h"

#include "stm32f4xx_it.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_gpio_ex.h"
#include "stm32f4xx_hal_rtc_ex.h"
#include "stm32_hal_legacy.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_rtc.h"
#include "stm32f4xx_hal_i2c.h"

#include "stm32f4xx_hal_exti.h"
#include "stm32f4xx_hal_uart.h"

#include <stdio.h>
#include <printf.h>
#include <string.h>

#include "usart.h"
#include "gpio.h"
#include "i2c.h"
#include "spi.h"
#include "rtc.h"
#include "bme280.h"
#include "tim.h"
#include "SSD1306_OLED.h"
#include "drv8835.h"
#include "INA219.h"
#include "ds3231.h"

#include "bh1750.h"
#include "ff.h"
#include "ff_gen_drv.h"
#include "user_diskio_spi.h"
#include "user_diskio.h"
#include "GFX_BW.h"
#include "fonts/font_8x5.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN Variables */

typedef struct {
		uint8_t Hour;
		uint8_t Minutes;
		uint8_t Seconds;
		uint8_t Day;
		uint8_t Month;
		uint16_t Year;
}Ds3231_t;
typedef struct {
	float Humidity;
	float Temperature;
	int32_t Pressure;
} BmeData_t;

typedef struct{
	uint16_t VoltageBus;
	uint16_t VoltageShunt;
	uint16_t Power;
	int16_t Current;

}INA219Data_t;

typedef struct {
	char MessageTemp[32];
	char MessageHum[32];
    char MessageInten[32];
    char MessageTime[32];
    char MessageData[32];
	char MessageTimePump[32];
	char MessagePvVoltageBus[32];
	char MessagePVVoltageShunt[32];
	char MessagePVCurrent[32];
	char MessagePVPower[32];
	char MessageBatVoltageBus[32];
	char MessageBatVoltageShunt[32];
	char MessageBatCurrent[32];
	char MessageBatPower[32];
	char MessageFreqAlarm[32];

}Data_Structure_t;
typedef struct {
	float LightIntensity;

} BHData_t;


/* USER CODE END Variables */
/* Definitions for TaskRTC */
osThreadId_t TaskRTCHandle;
const osThreadAttr_t TaskRTC_attributes = {
  .name = "TaskRTC",
  .stack_size = 2024 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskBme280 */
osThreadId_t TaskBme280Handle;
const osThreadAttr_t TaskBme280_attributes = {
  .name = "TaskBme280",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal1,
};
/* Definitions for TaskBH1750 */
osThreadId_t TaskBH1750Handle;
const osThreadAttr_t TaskBH1750_attributes = {
  .name = "TaskBH1750",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskSSD1306 */
osThreadId_t TaskSSD1306Handle;
const osThreadAttr_t TaskSSD1306_attributes = {
  .name = "TaskSSD1306",
  .stack_size = 4000 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskPumpON */
osThreadId_t TaskPumpONHandle;
const osThreadAttr_t TaskPumpON_attributes = {
  .name = "TaskPumpON",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskPumpOFF */
osThreadId_t TaskPumpOFFHandle;
const osThreadAttr_t TaskPumpOFF_attributes = {
  .name = "TaskPumpOFF",
  .stack_size = 256 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskCounterPump */
osThreadId_t TaskCounterPumpHandle;
const osThreadAttr_t TaskCounterPump_attributes = {
  .name = "TaskCounterPump",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskAlarmCounte */
osThreadId_t TaskAlarmCounteHandle;
const osThreadAttr_t TaskAlarmCounte_attributes = {
  .name = "TaskAlarmCounte",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskSdCard */
osThreadId_t TaskSdCardHandle;
const osThreadAttr_t TaskSdCard_attributes = {
  .name = "TaskSdCard",
  .stack_size = 3000 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskINA219 */
osThreadId_t TaskINA219Handle;
const osThreadAttr_t TaskINA219_attributes = {
  .name = "TaskINA219",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for TaskINA219PV */
osThreadId_t TaskINA219PVHandle;
const osThreadAttr_t TaskINA219PV_attributes = {
  .name = "TaskINA219PV",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for TaskDS3231 */
osThreadId_t TaskDS3231Handle;
const osThreadAttr_t TaskDS3231_attributes = {
  .name = "TaskDS3231",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityHigh,
};
/* Definitions for TaskSleep */
osThreadId_t TaskSleepHandle;
const osThreadAttr_t TaskSleep_attributes = {
  .name = "TaskSleep",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for QueueBme */
osMessageQueueId_t QueueBmeHandle;
const osMessageQueueAttr_t QueueBme_attributes = {
  .name = "QueueBme"
};
/* Definitions for QueueBh1750 */
osMessageQueueId_t QueueBh1750Handle;
const osMessageQueueAttr_t QueueBh1750_attributes = {
  .name = "QueueBh1750"
};
/* Definitions for QueueRTCData */
osMessageQueueId_t QueueRTCDataHandle;
const osMessageQueueAttr_t QueueRTCData_attributes = {
  .name = "QueueRTCData"
};
