Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
/* USER CODE BEGIN 5 */
void vApplicationMallocFailedHook(void)
{
   /* vApplicationMallocFailedHook() will only be called if
   configUSE_MALLOC_FAILED_HOOK is set to 1 in FreeRTOSConfig.h. It is a hook
   function that will get called if a call to pvPortMalloc() fails.
   pvPortMalloc() is called internally by the kernel whenever a task, queue,
   timer or semaphore is created. It is also called by various parts of the
   demo application. If heap_1.c or heap_2.c are used, then the size of the
   heap available to pvPortMalloc() is defined by configTOTAL_HEAP_SIZE in
   FreeRTOSConfig.h, and the xPortGetFreeHeapSize() API function can be used
   to query the size of free heap space that remains (although it does not
   provide information on how the remaining heap might be fragmented). */
}
/* USER CODE END 5 */

/**
  * @brief  FreeRTOS initialization
  * @param  None
  * @retval None
  */
void MX_FREERTOS_Init(void) {
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */
  /* Create the mutex(es) */
  /* creation of MutexPrintf */
  MutexPrintfHandle = osMutexNew(&MutexPrintf_attributes);

  /* creation of MutexI2C */
  MutexI2CHandle = osMutexNew(&MutexI2C_attributes);

  /* creation of MutexRTC */
  MutexRTCHandle = osMutexNew(&MutexRTC_attributes);

  /* creation of MutexAlarm */
  MutexAlarmHandle = osMutexNew(&MutexAlarm_attributes);

  /* creation of MutexI2C2 */
  MutexI2C2Handle = osMutexNew(&MutexI2C2_attributes);

  /* creation of MutexSdCard */
  MutexSdCardHandle = osMutexNew(&MutexSdCard_attributes);

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* Create the semaphores(s) */
  /* creation of BinarySemBme280 */
  BinarySemBme280Handle = osSemaphoreNew(1, 1, &BinarySemBme280_attributes);

  /* creation of BinarySemBH1750 */
  BinarySemBH1750Handle = osSemaphoreNew(1, 1, &BinarySemBH1750_attributes);

  /* creation of BinarySemRTC */
  BinarySemRTCHandle = osSemaphoreNew(1, 1, &BinarySemRTC_attributes);

  /* creation of BinarySemCounter */
  BinarySemCounterHandle = osSemaphoreNew(1, 1, &BinarySemCounter_attributes);

  /* creation of BinarySemSetAlarm */
  BinarySemSetAlarmHandle = osSemaphoreNew(1, 1, &BinarySemSetAlarm_attributes);

  /* creation of BinarySdCard */
  BinarySdCardHandle = osSemaphoreNew(1, 1, &BinarySdCard_attributes);

  /* creation of BinarySemINA219 */
  BinarySemINA219Handle = osSemaphoreNew(1, 1, &BinarySemINA219_attributes);

  /* creation of BinaryDs3231 */
  BinaryDs3231Handle = osSemaphoreNew(1, 1, &BinaryDs3231_attributes);

  /* creation of BinarySemIna219Bat */
  BinarySemIna219BatHandle = osSemaphoreNew(1, 1, &BinarySemIna219Bat_attributes);

  /* creation of BinarySemSleep */
  BinarySemSleepHandle = osSemaphoreNew(1, 1, &BinarySemSleep_attributes);

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* Create the timer(s) */
  /* creation of TimerBmeData */
  TimerBmeDataHandle = osTimerNew(CallbackTimerBmeData, osTimerPeriodic, NULL, &TimerBmeData_attributes);

  /* creation of TimerBh1750Data */
  TimerBh1750DataHandle = osTimerNew(CallbackTimerBh1750Data, osTimerPeriodic, NULL, &TimerBh1750Data_attributes);

  /* creation of TimerRTC */
  TimerRTCHandle = osTimerNew(CallbackTimerRTC, osTimerPeriodic, NULL, &TimerRTC_attributes);

  /* creation of TimerSDCard */
  TimerSDCardHandle = osTimerNew(CallbackTimerSDCard, osTimerPeriodic, NULL, &TimerSDCard_attributes);

  /* creation of TimerINA219 */
  TimerINA219Handle = osTimerNew(CallbackTimerINA219, osTimerPeriodic, NULL, &TimerINA219_attributes);

  /* creation of TimerINA219Bat */
  TimerINA219BatHandle = osTimerNew(CallbackTimerINA219Bat, osTimerPeriodic, NULL, &TimerINA219Bat_attributes);

  /* creation of TIMER_Sleep */
  TIMER_SleepHandle = osTimerNew(CallbackTimerSleep, osTimerPeriodic, NULL, &TIMER_Sleep_attributes);

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* creation of QueueBme */
  QueueBmeHandle = osMessageQueueNew (5, sizeof(BmeData_t), &QueueBme_attributes);

  /* creation of QueueBh1750 */
  QueueBh1750Handle = osMessageQueueNew (5, sizeof(BHData_t), &QueueBh1750_attributes);

  /* creation of QueueRTCData */
  QueueRTCDataHandle = osMessageQueueNew (1, sizeof(RTC_DateTypeDef), &QueueRTCData_attributes);

  /* creation of QueueRTCTime */
  QueueRTCTimeHandle = osMessageQueueNew (5, sizeof(RTC_TimeTypeDef), &QueueRTCTime_attributes);

  /* creation of QueueCounterPump */
  QueueCounterPumpHandle = osMessageQueueNew (1, sizeof(CONFIG_MANAGER), &QueueCounterPump_attributes);

  /* creation of QueueCounterAlarm */
  QueueCounterAlarmHandle = osMessageQueueNew (1, sizeof(CONFIG_MANAGER), &QueueCounterAlarm_attributes);

  /* creation of QueSDCARD */
  QueSDCARDHandle = osMessageQueueNew (1, sizeof(Data_Structure_t), &QueSDCARD_attributes);

  /* creation of QuequeBattery */
  QuequeBatteryHandle = osMessageQueueNew (2, sizeof(INA219Data_t), &QuequeBattery_attributes);

  /* creation of QueDs3231Time */
  QueDs3231TimeHandle = osMessageQueueNew (1, sizeof(RTC_TimeTypeDef), &QueDs3231Time_attributes);

  /* creation of QueueDs3231Date */
  QueueDs3231DateHandle = osMessageQueueNew (1, sizeof(RTC_DateTypeDef), &QueueDs3231Date_attributes);

  /* creation of QueuePV */
  QueuePVHandle = osMessageQueueNew (1, sizeof(INA219Data_t), &QueuePV_attributes);

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of TaskRTC */
  TaskRTCHandle = osThreadNew(StartTaskRTC, NULL, &TaskRTC_attributes);

  /* creation of TaskBme280 */
  TaskBme280Handle = osThreadNew(StartTaskBme280, NULL, &TaskBme280_attributes);

  /* creation of TaskBH1750 */
  TaskBH1750Handle = osThreadNew(StartTaskBH1750, NULL, &TaskBH1750_attributes);

