Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
  /* creation of TaskSSD1306 */
  TaskSSD1306Handle = osThreadNew(StartTaskSSD1306, NULL, &TaskSSD1306_attributes);

  /* creation of TaskPumpON */
  TaskPumpONHandle = osThreadNew(StartTaskPumpON, NULL, &TaskPumpON_attributes);

  /* creation of TaskPumpOFF */
  TaskPumpOFFHandle = osThreadNew(StartTaskPumpOFF, NULL, &TaskPumpOFF_attributes);

  /* creation of TaskCounterPump */
  TaskCounterPumpHandle = osThreadNew(StartTaskCounterPump, NULL, &TaskCounterPump_attributes);

  /* creation of TaskAlarmCounte */
  TaskAlarmCounteHandle = osThreadNew(StartTaskAlarmCounter, NULL, &TaskAlarmCounte_attributes);

  /* creation of TaskSdCard */
  TaskSdCardHandle = osThreadNew(StartTaskSdCard, NULL, &TaskSdCard_attributes);

  /* creation of TaskINA219 */
  TaskINA219Handle = osThreadNew(StartTaskINA219, NULL, &TaskINA219_attributes);

  /* creation of TaskINA219PV */
  TaskINA219PVHandle = osThreadNew(StartTaskINA219PV, NULL, &TaskINA219PV_attributes);

  /* creation of TaskDS3231 */
  TaskDS3231Handle = osThreadNew(StartTaskDS3231, NULL, &TaskDS3231_attributes);

  /* creation of TaskSleep */
  TaskSleepHandle = osThreadNew(StartTaskSleep, NULL, &TaskSleep_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

}

/* USER CODE BEGIN Header_StartTaskRTC */
/**
  * @brief  Function implementing the TaskRTC thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartTaskRTC */
void StartTaskRTC(void *argument)
{
  /* USER CODE BEGIN StartTaskRTC */
		extern RTC_HandleTypeDef hrtc;

	 	 RTC_TimeTypeDef _RTCTime ={0};

	 	 RTC_DateTypeDef _RTCDate = {0};

	 	 RTC_AlarmTypeDef _AlarmON, _AlarmOFF = {0};


	 	static uint8_t _PumpDispensing = 1;
	 	static uint8_t _AlarmPeriod = 1;
	 	uint8_t SdCard = 1;






	 	 _AlarmON.AlarmTime.Hours = 8 ;
	 	 _AlarmON.AlarmTime.Minutes = 0 ;
	 	_AlarmON.AlarmTime.Seconds = 0 ;


		 _AlarmOFF.AlarmTime.Hours = 8 ;
		 _AlarmOFF.AlarmTime.Minutes = 1 ;
		_AlarmOFF.AlarmTime.Seconds = 0 ;



		osThreadFlagsSet(TaskDS3231Handle, 0x00000100U);
	 	HAL_RTC_Init(&hrtc);

//		HAL_RTC_GetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
//		HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

//		HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
//		HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);


	// 	_RTCTime.Hours = 0x0;
	//    _RTCTime.Minutes =0x0;
	//	_RTCTime.Seconds =0x0;

		osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);


	 	osTimerStart(TimerRTCHandle, 300);
	 	uint32_t tick4 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  //	  osMessageQueuePut(QueueCounterPumpHandle, &_PumpOperatingTime, 0, 10);
	  //	  osMessageQueuePut(QueueAlarmHandle, &_AlarmPeriod, 0, 10);

	      printf("Task RTC start \n\r ");
	      if(osOK== osMessageQueueGet(QueDs3231TimeHandle, &_RTCTime, 0, 50))
	      {
	    	  HAL_RTC_SetTime(&hrtc,&_RTCTime, RTC_FORMAT_BIN);
	    	  if (_RTCTime.Hours +1 <=22)
				  {  	  _AlarmON.AlarmTime.Hours = _RTCTime.Hours + 1  ;
						 _AlarmON.AlarmTime.Minutes = 0;
						_AlarmON.AlarmTime.Seconds = 0 ;

						 _AlarmOFF.AlarmTime.Hours = _RTCTime.Hours + 1 ;
						 _AlarmOFF.AlarmTime.Minutes = 1 ;
						 _AlarmOFF.AlarmTime.Seconds = 0 ;
				  }
	    	  else
				  {
					  _AlarmON.AlarmTime.Hours = 8 	;
					  _AlarmON.AlarmTime.Minutes = 0;
					  _AlarmON.AlarmTime.Seconds = 0 ;
					  _AlarmOFF.AlarmTime.Hours = 8 ;
					 _AlarmOFF.AlarmTime.Minutes = 1 ;
					 _AlarmOFF.AlarmTime.Seconds = 0 ;
				  }
	    	  HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
	    	  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);

	    	  HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);

	      }
	      else if(osOK == osMessageQueueGet(QueueDs3231DateHandle, &_RTCDate, 0, 50))
	      {
	    	  HAL_RTC_SetDate(&hrtc,&_RTCDate, RTC_FORMAT_BIN);
	    	  HAL_RTC_GetDate(&hrtc,&_RTCDate, RTC_FORMAT_BIN);
	      }
	      else
	      {
	    	  HAL_RTC_GetDate(&hrtc, &_RTCDate, RTC_FORMAT_BIN);
	    	  HAL_RTC_GetTime(&hrtc, &_RTCTime, RTC_FORMAT_BIN);
	      }






	  	if (osOK == osSemaphoreAcquire(BinarySemCounterHandle, 0))
	  	{
	  		osMessageQueueGet(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);
//	  		_AlarmOFF.AlarmTime.Minutes = _PumpDispensing;

	  	}
	  	else if (osOK == osSemaphoreAcquire(BinarySemSetAlarmHandle, 0))
	  	{
	  		osMessageQueueGet(QueueCounterAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
//	  			  		_AlarmOFF.AlarmTime.Minutes = _AlarmPeriod;
	  	}


	  ////	  osMessageQueueGet(QueueAlarmHandle, &_AlarmPeriod, 0, 10);
	  //	  if(osOK == osSemaphoreAcquire(BinarySemSetAlarmHandle, 0))
	  //		{
	  //
	  //		  	  osMessageQueueGet(QueueAlarmHandle, &_AlarmPeriod, 0, 100);
	  //		  	  osMessageQueueGet(QueueCounterPumpHandle, &_PumpOperatingTime, 0, 100);
	  //			  _AlarmOFF.AlarmTime.Minutes = _PumpOperatingTime.Minutes;
	  //			  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);
	  //		}



	  	   if (_AlarmON.AlarmTime.Hours ==  _RTCTime.Hours && _AlarmON.AlarmTime.Minutes ==  _RTCTime.Minutes )
	  	  	  {
	  		      osMutexAcquire(MutexAlarmHandle, osWaitForever);
	  			  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,GPIO_PIN_SET);
	  			  osThreadFlagsSet(TaskPumpONHandle, 0x00000001U);
	  			  _AlarmON.AlarmTime.Hours = _AlarmON.AlarmTime.Hours + _AlarmPeriod;

	  			  if(_AlarmON.AlarmTime.Hours >= 22 || _AlarmON.AlarmTime.Hours <= 8)
	  				  {
	  					  _AlarmON.AlarmTime.Hours = 8;
	  				  }
	  			  HAL_RTC_SetAlarm(&hrtc, &_AlarmON, RTC_FORMAT_BIN);
	  			  osMutexRelease(MutexAlarmHandle);
	  	  	  }
	  	  else if(_AlarmOFF.AlarmTime.Hours ==  _RTCTime.Hours && _AlarmOFF.AlarmTime.Minutes ==  _RTCTime.Minutes )
	  	  	  {
	  		  	  osMutexAcquire(MutexAlarmHandle, osWaitForever);
	  			  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin,GPIO_PIN_RESET);
	  			  osThreadFlagsSet(TaskPumpOFFHandle, 0x00000010U);

