Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
	  			  _AlarmOFF.AlarmTime.Hours = _AlarmOFF.AlarmTime.Hours + _AlarmPeriod;

	  			if(_AlarmOFF.AlarmTime.Hours >= 22 || _AlarmOFF.AlarmTime.Hours <= 8)
	  			  	 {
	  			  		  _AlarmOFF.AlarmTime.Hours = 8;
	  			  	 }

	  			  HAL_RTC_SetAlarm(&hrtc, &_AlarmOFF, RTC_FORMAT_BIN);
	  			  osMutexRelease(MutexAlarmHandle);

	  	  	  }
	  	  else if (_RTCTime.Hours == 23 && _RTCTime.Minutes == 59)
	  	  {
	  		osThreadFlagsSet(TaskDS3231Handle, 0x00000100U);
	  	  }



	  //	  if(RTCTime.Seconds != CompareSeconds)
	  //	  {
	  //
	  //
	  //		  CompareSeconds = RTCTime.Seconds;
	  //	  }
	  	  if (osOK == osSemaphoreAcquire(BinarySemRTCHandle, 0)) {
	  //	  	  			osMessageQueuePut(QueueRTCDataHandle, &_RTCDate, 0, osWaitForever);
	  	  	  			osMessageQueuePut(QueueRTCTimeHandle, &_RTCTime, 0, osWaitForever);
	  	  	  			osMessageQueuePut(QueueRTCDataHandle, &_RTCDate, 0, osWaitForever);
	  	  	  		}



	  	  printf("Task RTC exit \n\r ");
	  	  tick4 += ((220 * osKernelGetTickFreq()) / 1000);
	  	  osDelayUntil(tick4);

  }
  /* USER CODE END StartTaskRTC */
}

/* USER CODE BEGIN Header_StartTaskBme280 */
/**
* @brief Function implementing the TaskBme280 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskBme280 */
void StartTaskBme280(void *argument)
{
  /* USER CODE BEGIN StartTaskBme280 */
	BmeData_t _BmeData;
		uint32_t tick3;
		osMutexAcquire(MutexI2CHandle, osWaitForever);
		BME280_Init(&hi2c1, BME280_TEMPERATURE_16BIT, BME280_PRESSURE_ULTRALOWPOWER,
		BME280_HUMINIDITY_STANDARD, BME280_NORMALMODE);
		osDelay(100);
		BME280_SetConfig(BME280_STANDBY_MS_10, BME280_FILTER_OFF);
		osMutexRelease(MutexI2CHandle);
		osTimerStart(TimerBmeDataHandle, 400);

		tick3 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {

	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	  printf("TASK BME280 start\n\r ");
	  	  BME280_ReadTemperatureAndPressureAndHuminidity(&_BmeData.Temperature,
	  	  				&_BmeData.Pressure, &_BmeData.Humidity);
	  	printf("TASK BME280 exit\n\r ");
	  	  osMutexRelease(MutexI2CHandle);

	  	  if (osOK == osSemaphoreAcquire(BinarySemBme280Handle, 0)) {
	  	  			osMessageQueuePut(QueueBmeHandle, &_BmeData, 0, osWaitForever);
	  	  		}

	  //	  printf("Temperature: %.2f, Humidity: %.2f z \n\r", _BmeData.Temperature, _BmeData.Humidity);
	  //////    osDelay(100);
	  		tick3 += (335 * osKernelGetTickFreq()) / 1000;
	  		osDelayUntil(tick3);
  }
  /* USER CODE END StartTaskBme280 */
}

/* USER CODE BEGIN Header_StartTaskBH1750 */
/**
* @brief Function implementing the TaskBH1750 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskBH1750 */
void StartTaskBH1750(void *argument)
{
  /* USER CODE BEGIN StartTaskBH1750 */
		uint32_t tick4;
		BHData_t _BHData;

		//	float BH1750_lux;

		osMutexAcquire(MutexI2CHandle, osWaitForever);
		BH1750_Init(&hi2c1);
		BH1750_SetMode(CONTINUOUS_HIGH_RES_MODE_2);
		osMutexRelease(MutexI2CHandle);

		osTimerStart(TimerBh1750DataHandle, 500);
		tick4 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {

	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	  printf("TASK BH1750 start \n\r ");
	 	  		BH1750_ReadLight(&_BHData.LightIntensity);
	 	  //	  	  printf("Light: %.2f \n\r", _BhData.LightIntensity);
	 	  		printf("TASK BH1750 exit \n\r ");
	 	  		osMutexRelease(MutexI2CHandle);

	 	  		if (osOK == osSemaphoreAcquire(BinarySemBH1750Handle, 0)) {
	 	  			osMessageQueuePut(QueueBh1750Handle, &_BHData, 0, osWaitForever);
	 	  		}
	 	  //	  	 	  if(BH1750_OK == BH1750_ReadLight(&BH1750_lux))
	 	  //	  	 	  	  {
	 	  //	  	 	  		  size = sprintf(buffer, "BH1750 Lux: %.2f\n\r", BH1750_lux);
	 	  //	  	 	  	  	  HAL_UART_Transmit(&huart2, (uint8_t*)buffer, size, 100);
	 	  //	  	 	  	  }

	 	  		tick4 += ((325 * osKernelGetTickFreq()) / 1000);
	 	  		osDelayUntil(tick4);
  }
  /* USER CODE END StartTaskBH1750 */
}

/* USER CODE BEGIN Header_StartTaskSSD1306 */
/**
* @brief Function implementing the TaskSSD1306 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskSSD1306 */
void StartTaskSSD1306(void *argument)
{
  /* USER CODE BEGIN StartTaskSSD1306 */
	Data_Structure_t _DataStructure;
	Data_Structure_t *PointerData =&_DataStructure;



	BmeData_t _BmeData;
	BHData_t _BHData;
	INA219Data_t _INA219_Battery ={0};
	INA219Data_t _INA219_PV ={0};

	RTC_TimeTypeDef _RTCTime2 = {0};
	 _RTCTime2.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
	 	 _RTCTime2.StoreOperation = RTC_STOREOPERATION_RESET;
	RTC_DateTypeDef _RTCData2 = {0};
	uint8_t _AlarmPeriod = 1;

	uint8_t _PumpDispensing = 1;


	uint32_t tick2;




	osMutexAcquire(MutexI2C2Handle, osWaitForever);
	SSD1306_Init(&hi2c1);
	osMutexRelease(MutexI2C2Handle);

	GFX_SetFont(font_8x5);
	SSD1306_Clear(BLACK);
	SSD1306_Display();

	osTimerStart(TimerSDCardHandle, 300000);
	tick2 = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  	  SSD1306_Clear(BLACK);
	  	  osMessageQueueGet(QueueBmeHandle, &_BmeData, 0, 50);
	  	  printf("1\n\r");
	  	  osMessageQueueGet(QueueBh1750Handle, &_BHData, 0, 50);
	  	  printf("2\n\r");
	  //	  osMessageQueueGet(QueueRTCDataHandle, &_RTCDate, 0,osWaitForever);


	  	  osMessageQueueGet(QuequeBatteryHandle, &_INA219_Battery, 0, 50);
	      printf("3\n\r");
	      osMessageQueueGet(QueuePVHandle, &_INA219_PV, 0, 100);
	    	  	  printf("4\n\r");
	  	  if (osOK == osMessageQueueGet(QueueRTCTimeHandle, &_RTCTime2, 0, 50))
	  	  {


	  		  printf("5\n\r");
	  	  }

	  	  if(osOK == osMessageQueueGet(QueueRTCDataHandle, &_RTCData2, 0, 50))
	  	  {


	  		  printf("6\n\r");
	  	  }




	  	  if(osOK== osMessageQueueGet(QueueCounterPumpHandle, &_PumpDispensing, 0, 50))
	  	  {

	  		  osMessageQueuePut(QueueCounterPumpHandle, &_PumpDispensing, 0, osWaitForever);
	  		  osSemaphoreRelease(BinarySemCounterHandle);
	  	  }

	  	  else 	if(osOK== osMessageQueueGet(QueueCounterAlarmHandle, &_AlarmPeriod, 0, 50))
	  	 {

