Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
	  		   osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod, 0, osWaitForever);
	  		   osSemaphoreRelease(BinarySemSetAlarmHandle);

	  	 }


//	  	   osMessageQueueGet(QueueCounterAlarmHandle, &_AlarmPeriod, 0, 50);


//	  	   osMessageQueuePut(QueueCounterPumpHandle, &_PumpOperatingTime, 0, osWaitForever);
	  	  sprintf(PointerData->MessageData, "Data: %02d.%02d.%02d;",_RTCData2.Date,_RTCData2.Month,_RTCData2.Year);
	      sprintf(PointerData->MessageTime, "%02d:%02d:%02d;",_RTCTime2.Hours,_RTCTime2.Minutes,_RTCTime2.Seconds);
	  	  sprintf(PointerData->MessageTemp, "T:%.2f C; ", _BmeData.Temperature);
	  	  sprintf(PointerData->MessageHum, "%.2f %;", _BmeData.Humidity);
	  	  sprintf(PointerData->MessageInten, "%.2f lx;", _BHData.LightIntensity);
	  	  sprintf(PointerData->MessageBatVoltageBus,"B:%u mV;", _INA219_Battery.VoltageBus);
	  	  sprintf(PointerData->MessageBatVoltageShunt,"B s:%u;",_INA219_Battery.VoltageShunt);
	  	  sprintf(PointerData->MessageBatCurrent,"B:%d mA;",_INA219_Battery.Current);
	  	  sprintf(PointerData->MessageBatPower,"B:%d mW;",_INA219_Battery.Power);
	  	  sprintf(PointerData->MessagePvVoltageBus,"P:%umV;",_INA219_PV.VoltageBus);
	      sprintf(PointerData->MessagePVVoltageShunt,"PV Voltage shunt: %u;",_INA219_PV.VoltageShunt);
	  	  sprintf(PointerData->MessagePVCurrent,"P:%d mA;",_INA219_PV.Current);
	  	  sprintf(PointerData->MessagePVPower,"P:%u mW;",_INA219_PV.Power);
	  	  //  sprintf(MessageData, "Data: %02d.%02d.20%02d  Time: %02d:%02d:%02d:%02d",_RTCDate.Date,_RTCDate.Month,_RTCDate.Year,_RTCTime.Hours,_RTCTime.Minutes,_RTCTime.Seconds);


	  	  sprintf(PointerData->MessageTimePump, "Pump:%02dMin;",_PumpDispensing);
	  	  sprintf(PointerData->MessageFreqAlarm, "Alarm:%02dH;", _AlarmPeriod);

	  	if (osOK == osSemaphoreAcquire(BinarySdCardHandle, 0)) {
	  		  	  			osMessageQueuePut(QueSDCARDHandle,PointerData, 0, 50);
	  		  	  		}




	  	  GFX_DrawString(0, 0, PointerData->MessageTime, WHITE, 0);
	  	  GFX_DrawString(70,0, PointerData->MessageBatVoltageBus,WHITE,0);
	  	  GFX_DrawString(0, 10, PointerData->MessageTemp, WHITE, 0);
	  	 GFX_DrawString(70,10, PointerData->MessageBatCurrent,WHITE,0);
	  	  GFX_DrawString(0, 20, PointerData->MessageHum, WHITE, 0);
	  	GFX_DrawString(70,20, PointerData->MessageBatPower,WHITE,0);
	  	  GFX_DrawString(0, 30, PointerData->MessageInten, WHITE, 0);
	  	 GFX_DrawString(70,30, PointerData->MessagePvVoltageBus,WHITE,0);
	  	  GFX_DrawString(0, 40, PointerData->MessageTimePump, WHITE, 0);
	  	GFX_DrawString(70,40, PointerData->MessagePVCurrent,WHITE,0);
	  	  GFX_DrawString(0, 50, PointerData->MessageFreqAlarm, WHITE, 0);
	  	GFX_DrawString(70,50, PointerData->MessagePVPower,WHITE,0);

	  	  SSD1306_Display();

	  	  printf("TASK OLED \n\r");

	  //		printf("TASK OLED I2C MUTEX is released \n\r");
	        tick2 += (600 * osKernelGetTickFreq()) / 1000;
	  	  osDelayUntil(tick2);
  }
  /* USER CODE END StartTaskSSD1306 */
}

/* USER CODE BEGIN Header_StartTaskPumpON */
/**
* @brief Function implementing the TaskPumpON thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskPumpON */
void StartTaskPumpON(void *argument)
{
  /* USER CODE BEGIN StartTaskPumpON */
	drv8835_init();
  /* Infinite loop */
  for(;;)
  {

	  osThreadFlagsWait(0x00000001U, osFlagsWaitAll, osWaitForever);

	  drv8835_set_motorA_speed(99);
	  osThreadFlagsClear(0x00000001U);
  }
  /* USER CODE END StartTaskPumpON */
}

/* USER CODE BEGIN Header_StartTaskPumpOFF */
/**
* @brief Function implementing the TaskPumpOFF thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskPumpOFF */
void StartTaskPumpOFF(void *argument)
{
  /* USER CODE BEGIN StartTaskPumpOFF */
  /* Infinite loop */
  for(;;)
  {
	  osThreadFlagsWait(0x00000010U, osFlagsWaitAll, osWaitForever);


	  	  drv8835_set_motorA_speed(0);

  }
  /* USER CODE END StartTaskPumpOFF */
}

/* USER CODE BEGIN Header_StartTaskCounterPump */
/**
* @brief Function implementing the TaskCounterPump thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskCounterPump */
void StartTaskCounterPump(void *argument)
{
  /* USER CODE BEGIN StartTaskCounterPump */
	static uint8_t _PumpDipensing = 1;
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  if(HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin)== GPIO_PIN_RESET)
	 	  {
	 	  	  _PumpDipensing= _PumpDipensing + 1;
	 	  		if(_PumpDipensing >=60)
	 	  		{
	 	  			_PumpDipensing = 1;
	 	  		}
	 	  		osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 50);
	 	  }
	 	  else if(HAL_GPIO_ReadPin(B2_GPIO_Port, B2_Pin)== GPIO_PIN_RESET)
	 	  {
	 		  _PumpDipensing= _PumpDipensing -1;
	 		 	  		if(_PumpDipensing <=0)
	 		 	  		{
	 		 	  			_PumpDipensing = 59;
	 		 	  		}
	 		   osMessageQueuePut(QueueCounterPumpHandle, &_PumpDipensing , 0, 50);
	 	  }

	 	  	  	tick += (220 * osKernelGetTickFreq()) / 1000;
	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskCounterPump */
}

/* USER CODE BEGIN Header_StartTaskAlarmCounter */
/**
* @brief Function implementing the TaskAlarmCounte thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskAlarmCounter */
void StartTaskAlarmCounter(void *argument)
{
  /* USER CODE BEGIN StartTaskAlarmCounter */
	static uint8_t _AlarmPeriod = 1;
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {
	  	  	  if(HAL_GPIO_ReadPin(B3_GPIO_Port, B3_Pin)== GPIO_PIN_RESET)
	 	 	  {
	 	 	  	  _AlarmPeriod= _AlarmPeriod + 1;
	 	 	  		if(_AlarmPeriod >=16)
	 	 	  		{
	 	 	  			_AlarmPeriod = 1;
	 	 	  		}
	 	 	  		osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod , 0, 50);
	 	 	  }
	 	 	  else if(HAL_GPIO_ReadPin(B4_GPIO_Port, B4_Pin)== GPIO_PIN_RESET)
	 	 	  {
	 	 		  _AlarmPeriod= _AlarmPeriod - 1;
	 	 		 	  		if(_AlarmPeriod <=0)
	 	 		 	  		{
	 	 		 	  			_AlarmPeriod = 16;
	 	 		 	  		}
	 	 		   osMessageQueuePut(QueueCounterAlarmHandle, &_AlarmPeriod , 0, 50);
	 	 	  }

