Mateuszworo97/Projects/Embedded_projects/Stm32_ApiaryWaterDispensingSystem2/Core/Src/freertos.c
	 	 	  	  	tick += (200 * osKernelGetTickFreq()) / 1000;
	 	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskAlarmCounter */
}

/* USER CODE BEGIN Header_StartTaskSdCard */
/**
* @brief Function implementing the TaskSdCard thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskSdCard */
void StartTaskSdCard(void *argument)
{
  /* USER CODE BEGIN StartTaskSdCard */

	FRESULT FatFsResult;
	FATFS SdFatFs;
	FIL SdCardFile;

	uint8_t bytes;
	char data[128];

	Data_Structure_t _Data_StructureGet = {0};
	Data_Structure_t *PointerDataZ = &_Data_StructureGet;

	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {



	  	  	 if (osOK == osMessageQueueGet(QueSDCARDHandle, PointerDataZ, 0, osWaitForever))
	  	  	 {


				  FatFsResult = f_mount(&SdFatFs, "", 1);
				  if(FatFsResult != FR_OK)
				  {
					  bytes = sprintf(data, "FatFS mount error.\n\r");
					  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
				  }

				  else
				  {
					  bytes = sprintf(data, "FatFS mounted.\n\r");
					  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);

					  //
					  // Open file on SD for writing
					  //

					  FatFsResult = f_open(&SdCardFile, "badania4.csv", FA_WRITE|FA_OPEN_APPEND);

					  //
					  // File open error check
					  //
					  if(FatFsResult != FR_OK)
					  {
						  bytes = sprintf(data, "No badaniam.csv file. Can't create.\n\r");
						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
					  }


					  else
					  {

						  bytes = sprintf(data, "File opened.\n\r");
						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);

						  //
						  //	Print something to this file
						  //
						  f_printf(&SdCardFile,PointerDataZ->MessageData);
						  f_printf(&SdCardFile,PointerDataZ->MessageTime);
						  f_printf(&SdCardFile,PointerDataZ->MessageTemp);
						  f_printf(&SdCardFile,PointerDataZ->MessageHum);
						  f_printf(&SdCardFile,PointerDataZ->MessageInten);
						  f_printf(&SdCardFile,PointerDataZ->MessageBatVoltageBus);
						  f_printf(&SdCardFile,PointerDataZ->MessageBatVoltageShunt);
						  f_printf(&SdCardFile,PointerDataZ->MessageBatCurrent);
						  f_printf(&SdCardFile,PointerDataZ->MessageBatPower);
						  f_printf(&SdCardFile,PointerDataZ->MessagePvVoltageBus);
						  f_printf(&SdCardFile,PointerDataZ->MessagePVVoltageShunt);
						  f_printf(&SdCardFile,PointerDataZ->MessagePVCurrent);
						  f_printf(&SdCardFile,PointerDataZ->MessagePVPower);

						  f_printf(&SdCardFile,PointerDataZ->MessageTimePump);
						  f_printf(&SdCardFile,PointerDataZ->MessageFreqAlarm);
						  f_printf(&SdCardFile,"\n");




			  //  		  for(uint8_t i = 0; i < 10; i++)
			  //  		  {
			  //  			  f_printf(&SdCardFile, "Line number %d;", i);
			  //  		  }

						  //
						  // Close file
						  //
						  FatFsResult = f_close(&SdCardFile);

						  bytes = sprintf(data, "File closed!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!.\n\r");
						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);


						 //
								  // Open file on SD for reading
								  //
	//					  FatFsResult = f_open(&SdCardFile, "badaniaFreertos.csv", FA_READ);
	//					  if(FatFsResult != FR_OK)
	//				  {
	//						  bytes = sprintf(data, "No badaniaFreertos.csv file. Can't create.\n\r");
	//						HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
	//				  }
	//					else
	//						{
	//						UINT len;
	//
	//							do
	//							{
	//								len=0;
	//								f_read(&SdCardFile, data,10,&len);
	//								HAL_UART_Transmit(&huart2, (uint8_t*)data, len, 1000);
	//							} while (len >0);
	//
	//						  FatFsResult = f_close(&SdCardFile);
	//						  bytes = sprintf(data, "File closed.\n\r");
	//						  HAL_UART_Transmit(&huart2, (uint8_t*)data, bytes, 1000);
	//						}




					  }
				  	  }


			  }



			tick += (150000 * osKernelGetTickFreq()) / 1000;
				  	 	 	  	  	osDelayUntil(tick);
  }
  /* USER CODE END StartTaskSdCard */
}

/* USER CODE BEGIN Header_StartTaskINA219 */
/**
* @brief Function implementing the TaskINA219 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTaskINA219 */
void StartTaskINA219(void *argument)
{
  /* USER CODE BEGIN StartTaskINA219 */

	INA219_t ina219_2;
	ina219_calibration ina219_calibration;
	ina219_calibration.ina219_calibrationValue = 4096;
	ina219_calibration.ina219_currentDivider_mA = 10; // Current LSB = 100uA per bit (1000/100 = 10)
	ina219_calibration.ina219_powerMultiplier_mW = 2; // Power LSB = 1mW per bit (2/1)
//	ina219_calibration.ina219_calibrationValue = 8192;
//		ina219_calibration.ina219_currentDivider_mA = 20; // Current LSB = 100uA per bit (1000/100 = 10)
//		ina219_calibration.ina219_powerMultiplier_mW = 1.0f; // Power LSB = 1mW per bit (2/1)
	INA219Data_t _ina219;
	INA219Data_t *INA_219_pointer2 = &_ina219;





	 osMutexAcquire(MutexI2CHandle, osWaitForever);
	 INA219_Init(&ina219_2, &hi2c1, INA219_ADDRESS_BAT,&ina219_calibration);
	 INA219_setCalibration_32V_2A(&ina219_2,&ina219_calibration);

	 osMutexRelease(MutexI2CHandle);
	osTimerStart(TimerINA219BatHandle, 450);
	uint32_t tick = osKernelGetTickCount();
  /* Infinite loop */
  for(;;)
  {


	  	  osMutexAcquire(MutexI2CHandle, osWaitForever);
	  	  printf("INA219 Mutex Acquire\n\r");
		  INA_219_pointer2->VoltageBus = INA219_ReadBusVoltage(&ina219_2);
		  INA_219_pointer2->VoltageShunt = INA219_ReadShuntVolage(&ina219_2);
		  INA_219_pointer2->Current =  INA219_ReadCurrent(&ina219_2);
		  INA_219_pointer2->Power = INA219_ReadPower(&ina219_2, &ina219_calibration);
		 //

//
		  osMutexRelease(MutexI2CHandle);
		  printf("INA219 Mutex Released\n\r");
//
		  if (osOK == osSemaphoreAcquire(BinarySemIna219BatHandle, 0)) {
		  	 	  			osMessageQueuePut(QuequeBatteryHandle, INA_219_pointer2, 0, osWaitForever);
		  	 	  		}
		  printf("INA219 exit \n\r");
//


